In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
df=pd.read_csv('/home/student/Downloads/data.csv')

In [6]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,109,72,74
1,male,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,NaN,NaN,47,23,44
4,male,group C,NaN,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,1048,95
996,male,group C,high school,free/reduced,none,62,1049,55
997,female,group C,high school,free/reduced,completed,59,1050,65
998,female,group D,some college,standard,completed,68,1051,77
999,female,group D,some college,free/reduced,none,77,1052,86

In [8]:
# using groupby function with aggregation
# to get mean, min and max values
result = df.groupby('gender').agg({'math score': ['mean', 'min', 'max']})

print("Mean, min, and max values of math values according to gender of person")
print(result)
i

Mean, min, and max values of math values according to gender of person
       math score
             mean min  max
gender
female  63.694391   0  150
male    68.896480  27  130

In [15]:
result = df.groupby('race/ethnicity').agg({'math score': ['mean', 'min', 'max']})

print("Mean, min, and max values of math values according to gender of person")
print(result)

Mean, min, and max values of math values according to gender of person
               math score
                     mean min  max
race/ethnicity
group A         61.911111  25  100
group B         64.110526   8  150
group C         64.373041   0   98
group D         67.371648  26  100
group E         73.821429  30  100

In [12]:
df.median(numeric_only=True)
#median

math score        66.0
reading score    552.5
writing score     69.0
dtype: float64

In [13]:
df.mode(numeric_only=True)
#mode

   math score  reading score  writing score
0        65.0             54           74.0
1         NaN             72            NaN
2         NaN             95            NaN

In [14]:
df.std(numeric_only=True)
#standard deviation

math score        15.730849
reading score    289.031834
writing score     15.184100
dtype: float64

In [16]:
df.var(numeric_only=True)
#variance

math score         247.459611
reading score    83539.401001
writing score      230.556908
dtype: float64

In [18]:
df.rank

<bound method NDFrame.rank of      gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1      male        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree           NaN
4      male        group C                         NaN      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none         109             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                       NaN          47             23             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88           1048             95
996                    none          62           1049             55
997               completed          59           1050             65
998               completed          68           1051             77
999                    none          77           1052             86

[1000 rows x 8 columns]>

In [20]:
df.rank(method='average',numeric_only=True,na_option='keep',pct=True)
#percentage rank of data

     math score  reading score  writing score
0        0.9980         0.0210         0.6330
1        0.5745         0.0355         0.9070
2        0.9435         0.0420         0.9565
3        0.1030         0.0010         0.0655
4        0.7330         0.0280         0.6615
..          ...            ...            ...
995      0.9255         0.9960         0.9705
996      0.3840         0.9970         0.2095
997      0.3075         0.9980         0.3965
998      0.5465         0.9990         0.7095
999      0.7555         1.0000         0.8845

[1000 rows x 3 columns]

In [22]:
df.cov()
#covariance

               math score  reading score  writing score
math score     247.459611     115.015355     181.771521
reading score  115.015355   83539.401001     247.376036
writing score  181.771521     247.376036     230.556908

In [25]:
df.count()

gender                         1000
race/ethnicity                 1000
parental level of education     996
lunch                           998
test preparation course         997
math score                     1000
reading score                  1000
writing score                  1000
dtype: int64

In [24]:
df.kurt(numeric_only=True)
#unbiased kurtosis

math score       1.165964
reading score   -1.196106
writing score   -0.027289
dtype: float64

In [26]:
df.quantile(interpolation='linear')
#value of 50 percent quantile

math score        66.0
reading score    552.5
writing score     69.0
Name: 0.5, dtype: float64

In [29]:
df.skew(numeric_only=True)
#unbiased skewness

math score      -0.092927
reading score   -0.002652
writing score   -0.289407
dtype: float64

In [30]:
df.sem(numeric_only=True)
#standard error of mean

math score       0.497453
reading score    9.139989
writing score    0.480163
dtype: float64

In [31]:
df.clip()
#Trim values at input threshold(s).

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,109,72,74
1,male,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,NaN,NaN,47,23,44
4,male,group C,NaN,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,1048,95
996,male,group C,high school,free/reduced,none,62,1049,55
997,female,group C,high school,free/reduced,completed,59,1050,65
998,female,group D,some college,standard,completed,68,1051,77
999,female,group D,some college,free/reduced,none,77,1052,86

In [35]:
df.corr(method='pearson')
#Compute pairwise correlation of columns,

               math score  reading score  writing score
math score       1.000000       0.025296       0.761000
reading score    0.025296       1.000000       0.056367
writing score    0.761000       0.056367       1.000000